{"/about/":{"data":{"":" Hi, I’m Arbaaz Jamadar, a graduate student at University of maryland, College Park specializing in Cybersecurity. I love to tinker with technology I use my homelab to conduct experiments with technologies in virtualization, network security, SIEMs, Performance monitoring. The HomeLab is like my personal cloud to tinker with.\nFeel free to connect with me on LinkedIn to share ideas and collaborate. To check out my writeups, projects, what I am working on right now, visit arbaazjamadar.com"},"title":"About"},"/docs/firewall/":{"data":{"":"","#":"This guide covers the Firewall Configuration for the ProxHome homelab, utilizing pfSense as the primary firewall and router. The firewall sits at the core of the ProxHome network topology and manages traffic between WAN, LAN, and DMZ subnets, as well as access control for services and remote VPN connections via Tailscale.\nFirewall Overview\rProxHome uses pfSense, a robust open-source firewall/router software, deployed as a virtual machine inside the Proxmox environment. pfSense handles:\nInter-VLAN Routing NAT and Port Forwarding Traffic Filtering (Inbound \u0026 Outbound) VPN Gateway via Tailscale Access Control between LAN, DMZ, and WAN Interface Mapping\rInterface pfSense Name Bridge Subnet Purpose net0 WAN vmbr0 192.168.1.1/24 External / Internet access net1 LAN vmbr1 10.10.1.1/24 Internal trusted network net2 DMZ vmbr2 10.10.200.1/24 Exposed services network "},"title":"Firewall Configuration"},"/docs/hardware/":{"data":{"":"","#":"To create a reliable yet compact setup, I’ve carefully selected the following hardware components:\nGMKTec M5 Plus Mini PC:\rProcessor: AMD Ryzen 7 5825U (8C/16T, Up to 4.4GHz) RAM: 32GB DDR4 Storage: 1TB NVMe SSD Graphics: Integrated AMD Radeon (Supports 4K@60Hz Output) Networking: WiFi 6 Bluetooth 5.2 Ethernet (2.5 GbE) Operating System: Proxmox VE 8.x (A baremetal hypervisor) Cooling System\rAn external cooling system like fan can help maintain temprature and keep the system stable under stress. "},"title":"Hardware Configuration"},"/docs/introduction/":{"data":{"":"","configuration#Configuration":"","features#Features":"","network-topology#Network Topology":"","questions-or-feedback#Questions or Feedback?":"Welcome to my ProxHome HomeLab Documentation!\nWhat is ProxHome?\rProxHome is my approach to tinker with technology and building a versatile home lab using open-source technologies like Proxmox, pfSense, Tailscale, ELK stack and TrueNAS. It enables me to test my knowledge and hone it in a controlled and secure environment keeping my coureswork and imporant data isolated from the stuff I am working on, enabling me to experiment with virtualized environments, networking strategies, and software integrations securely and conveniently at home.\nNetwork Topology\rConfiguration\rHardware ConfigurationOverview of the hardware powering the ProxHome.\rNetwork ConfigurationManaging virtual networks within Proxmox.\rFirewall ConfigurationSecuring the network using pfSense firewall rules.\rVPN ConfigurationEnabling remote access through Tailscale VPN.\rFeatures\rPowerful Virtualization – ProxHome leverages Proxmox VE’s a purpose built hypervisor with an intuitive web interface to efficiently manage virtual machines and containers, ensuring flexibility and scalability.\nRobust Network Security – The lab integrates pfSense firewall/router capabilities, delivering advanced security features, VPN connectivity, and comprehensive network monitoring.\nSeamless Remote Access – TailScale provides secure, reliable remote connectivity within the lab environment, with minimal setup and low-maintenance operation.\nObservability - ELK stack works as a centralized monitoring system which collect logs, and metrics from machines in DMZ, and LAN. This helps monitor and manage resources in a efficient way (In-progress)\nReliable Storage Management – TrueNAS is used for data organization, advanced snapshotting, redundancy, and secure file-sharing, enhancing overall data resilience. (In-Progress)\nExtensible and Customizable – ProxHome offers extensibility through scripting, automation, thorough documentation, Configuration as a Code and powerful integrations, allowing flexible customization.\nOptimized for Learning and Growth – The project is structured to provide a practical, accessible learning environment suitable for all skill levels, from beginners to experienced IT professionals.\nQuestions or Feedback?\r⚠️\rProxHome is still in active development. Questions/Suggestions: open an issue","what-is-proxhome#What is ProxHome?":""},"title":"Introduction"},"/docs/network/":{"data":{"":"","#":"This guide outlines how the network topology is structured within the ProxHome homelab infrastructure, which is powered by Proxmox VE, pfSense, and Tailscale.\nOverview\rProxHome uses a virtualized network architecture segmented into three main subnets:\nWAN: 192.168.1.1/24 LAN: 10.10.1.1/24 DMZ: 10.10.1.200/24 A pfSense virtual firewall routes and filters traffic between these networks, enabling secure connectivity, isolation, and full-tunnel VPN access.\nTopology Components\rProxmox VE Host\rActs as the virtualization platform. Provides virtual bridges (vmbr0, vmbr1, vmbr2) to connect VMs to pfSense and the physical network. Virtual Bridges (vmbr)\rvmbr0 – WAN bridge connected to the router (192.168.1.0/24) vmbr1 – LAN bridge for internal VMs (10.10.1.1/24) vmbr2 – DMZ bridge for exposed services (10.10.200.1/24) pfSense Firewall (VM)\rInterfaces: net0 (WAN): Connected to vmbr0 net1 (LAN): Connected to vmbr1 net2 (DMZ): Connected to vmbr2 Handles inter-VLAN routing, NAT, firewall rules, and VPN access. Internal VMs\rParrot Desktop VM Connected to LAN via vmbr1 Ubuntu Server Connected to DMZ via vmbr2 External Network\rRouter\rDefault Gateway: 192.168.1.1 Provides internet access for the Proxmox host and pfSense WAN interface. External Access\rDevices on the 192.168.1.1/24 subnet can access the pfSense WAN. Tailscale provides full-tunnel VPN access, enabling remote access to internal services securely over the internet. VPN Integration (Tailscale)\rFull-tunnel VPN routes traffic from external devices through pfSense. Ensures encrypted remote access to LAN and DMZ resources. Subnet Breakdown\rNetwork Subnet Purpose Bridge Devices WAN 192.168.1.0/24 External access to Internet vmbr0 pfSense (WAN), Router, Proxmox LAN 10.10.1.1/24 Internal/Trusted VM network vmbr1 Parrot VM DMZ 10.10.200.1/24 Untrusted services vmbr2 Ubuntu Server "},"title":"Network Configuration"},"/docs/vpn/":{"data":{"":"","#":"This section covers how VPN access is configured in the ProxHome homelab using Tailscale. Tailscale provides secure, encrypted, and authenticated remote access to internal services across the LAN and DMZ without the complexity of traditional VPNs.\nWhy Tailscale?\rTailscale is a mesh VPN built on WireGuard, designed to simplify secure networking across devices and networks. It is ideal for homelabs because:\nZero-config networking over the internet Device-level access control (ACLs) Works through NAT/firewalls works like a magic. No need to configure NATs to allow access, it can travel through NAT to allow access to machines Supports full-tunnel VPN routing ProxHome VPN Topology\rTailscale is installed on the Ubuntu-server VM. A subnet is advertised, this enables tailscale to integrate the advertised subnet into its network. The routes advertised are LAN (10.10.1.1/24) and DMZ (10.10.200.1/24) After advertising the routes, enable Exit Node. Enable exit node so that the traffic can be proxied through the network via the Ubuntu Server with tailscale installed on it. Note:\rWhy not install Tailscale directly on pfsense? While installing Tailscale directly on pfSense may seem like an efficient approach, it poses significant security risks. In the event of a zero-day remote code execution (RCE) vulnerability in Tailscale, an attacker could potentially gain elevated privileges, modify routing tables, block network traffic, and even lock out administrative access. Avoiding direct installation helps minimize the impact of a potential supply chain compromise and protects the integrity of the entire network. "},"title":"VPN Configuration"}}